martin.org
#+TITLE Literate Emacs Configuration
#+AUTHOR: Martin Homuth
#+EMAIL: martin@followthestack.tech

Inspired by [[https://protesilaos.com/][Protesilaos Stavrou]] I changed my Emacs configuration to a
literate configuration. That especially includes a structuring process
allowing me to clean up the files to be generated. This file is the
source of the new setup which is then tangled into the sub structures
as follows

- early-init.el
- init.el
- mh-modules
- mh-lisp

* Structural Commands

To ensure the modules are loaded properly, they need to be adeed to
the load path and all modules have to be required. For now we
explicitly require them, but in the future I'd like to have a macro
for it to automatically obtain the provisioning and requirement via
the =init.el=.

  #+begin_src emacs-lisp :tangle "init.el"
    (mapc
     (lambda (string)
       (add-to-list 'load-path (locate-user-emacs-file string)))
     '("mh-lisp" "mh-modules"))
  #+end_src

  #+RESULTS:
  | mh-lisp | mh-modules |

Also I want to make sure that this file is always tangled as soon as
it is saved.

#+begin_src emacs-lisp
  (defun mh--tangle-this-file()
    """
     Tangles this buffers file.
    """
    (org-babel-tangle-file (buffer-file-name (current-buffer))))

  (add-hook 'after-save-hook 'mh--tangle-this-file nil t)
#+end_src

#+RESULTS:
| mh--tangle-this-file | flycheck-handle-save | t |

* Personal Information

If for some reason any application will need personal information,
here they are ;-)

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (setq user-full-name "Martin Homuth")
#+END_SRC

#+RESULTS:
: Martin Homuth

Load all the things I don't like to share with the world or think is
better be extracted from this file.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (let ((file (expand-file-name "~/.emacs.d/secrets.el")))
    (if (file-exists-p file)
        (load file)))
#+END_SRC

#+RESULTS:
: t

And configure some custom stuff that is also based on the system emacs
pis running on. There are four systems that I consider:
 1. Desktop (melchior)
 2. Work Desktop (devpool16)
 3. Work Laptop (mobilepool16)
 4. Any other system (servers)

#+begin_src emacs-lisp :tangle "init.el"
  ;;; mail address based on username
  (setq user-mail-address
        (let ((username (getenv "USER")))
          (cond ((string= username "martin") "martin@followthestack.tech")
                ((string= username "mhomuth") "mh@emlix.com")
                "martin@followthestack.tech")))

  ;;; fontsize based on screen resolution
  (if (display-graphic-p)
      (setq fontsize
            (let ((width (x-display-pixel-width)))
              (cond ((eql width 6336) 10) ;;; 2 monitor workstation in office
                    (t 9)))))

#+end_src

* Emacs Initialization

These settings are for emacs internals, nothing specific.

** the =early-init.el= file

Just to make sure specific things are loaded as soon as possible

#+begin_src emacs-lisp :tangle early-init.el
  (setq custom-file (expand-file-name "custom.el" (concat (getenv "HOME") "/.emacs.d/")))
  (when (file-exists-p custom-file)
    (load custom-file))

  (add-to-list 'load-path "~/elisp/org-mode/lisp")
  (add-to-list 'load-path "~/elisp/org-mode/contrib/lisp")
  (add-to-list 'load-path "/usr/share/emacs/site-lisp")

  (mapc
   (lambda (string)
     (add-to-list 'load-path (locate-user-emacs-file string)))
   '("mh-lisp" "mh-modules"))
#+end_src

** the final =init.el= call to submodules

#+begin_src emacs-lisp :tangle "init.el"
  (require 'mh-org)
#+end_src

** add Package Sources

Use additional sources for the packages, and ensure that use-package
is available

   #+BEGIN_SRC emacs-lisp :tangle early-init.el
     (setq package-archives
           '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
             ("nongnu" . "https://elpa.nongnu.org/nongnu/")
             ("melpa" . "https://melpa.org/packages/")))

     ;; Highest number gets priority (what is not mentioned has priority 0)
     (setq package-archive-priorities
           '(("gnu-elpa" . 3)
             ("melpa" . 2)
             ("nongnu" . 1)))

     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
     (eval-when-compile
       (require 'use-package))

     ;; also keep the packages up to date
     (use-package auto-package-update
       :ensure t
       :config
       (setq auto-package-update-delete-old-versions t)
       (setq auto-package-update-hide-results t)
       (auto-package-update-maybe))
   #+END_SRC

** Emacs Fonts and Locale

I guess I set fonts manually.. Maybe there is a better way for this.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  ;; TODO: add default font and fontsize
  (when (boundp 'fontsize)
    (add-to-list 'default-frame-alist
                 `(font . ,(concat "Source Code Pro-" (number-to-string fontsize)))
                 `(font . ,(concat "Noto Color Emoji" (number-to-string fontsize)))
                 ))

    ;; Treat clipboard as UTF-8 string first
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

  ;; see https://github.com/rolandwalker/unicode-fonts
  (use-package unicode-fonts
    :ensure t
    :config
    (unicode-fonts-setup))
#+END_SRC

#+RESULTS:
| UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |

** Frame Position and Size

TODO: add configuration that is different accross all devices

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (progn
    (setq initial-frame-alist '( (tool-bar-lines . 0)))
    (if (window-system)
        (nconc initial-frame-alist
              '(
                (width . 230) ; chars
                (height . 60) ; lines
                (left . 1261)
                (top . 514))))
    (setq default-frame-alist '( (tool-bar-lines . 0)))
    (if (window-system)
        (nconc default-frame-alist
              '(
                (width . 230) ; chars
                (height . 60) ; lines
                (left . 1261)
                (top . 514))))
  )
#+END_SRC

** Window Handling

As of yet I never tried understanding how window positioning and
sizing works by default. Thanks to [[https://www.youtube.com/watch?v=-H2nU0rsUMY][System Crafters]] I started to
understand it a bit more, this is the first step towards a fully
customized setup that fits my needs - and before I dive into the
manual.

#+begin_src emacs-lisp :tangle "init.el"
  (setq display-buffer-base-action
        '((display-buffer-reuse-window
           display-buffer-reuse-mode-window
           display-buffer-same-window
           display-buffer-in-previous-window)
          . ((mode . (org-mode helpful-mode help-mode)))))
#+end_src

** Simple Terminal (st) fixup

With st I experienced a rather large delay when opening files with
emacsclient that initially showed some other buffer before switching
to the desired file. The following hack should prevent this, for
whatever reason.

#+begin_src emacs-lisp :tangle "init.el"
  (if (not (assoc "xterm-256color" term-file-aliases))
      (setq term-file-aliases (cons '("xterm-256color" . "rxvt")
                                    term-file-aliases)))
  (if (not (assoc "st" term-file-aliases))
      (setq term-file-aliases (cons '("st" . "xterm-256color")
                                    term-file-aliases)))

#+end_src

** Themes

For now I use the same theme for all my machines. This will be
refactored later for allowing different themes.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (unless (package-installed-p 'gruvbox-theme)
    (package-refresh-contents)
    (package-install 'gruvbox-theme))
  (load-theme 'gruvbox t)
  (setq-default cursor-type 'box)
#+END_SRC

#+RESULTS:
: t

** Emacs-Server

Starting the server at emacs start should be handy someday..

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (if (or (not (fboundp 'server-running-p))
          (not (server-running-p)))
      (server-start))
#+END_SRC

#+RESULTS:

** Backup

The file backups emacs uses are pretty annoying, so I place them in a
separate directory instead of next to the file in use. If needed these
files are accessible there quite easily.

If this variable is nil, or it fails to match a filename, the backup
is made in the original file's directory. This is what I really don't
want.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

** Auto-Revert

I am working with different computers on the same text base controlled
by git and some background jobs that keep the git repositories current
by some means. As the files are always opened and essential to my
organization, I need to make sure that the opened buffers are current
all the time. Apparantly global-auto-revert-mode does the trick.

#+begin_src emacs-lisp :tangle "init.el"
  (global-auto-revert-mode)
#+end_src

#+RESULTS:
: t

** Auto-Compile

Enable auto compilation to ensure to never load out of date lisp modules

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package auto-compile
    :ensure t
    :init (setq load-prefer-newer t)
    :config
    (auto-compile-on-load-mode)
    (auto-compile-on-save-mode))
#+END_SRC

#+RESULTS:
: t

** General Configuration

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (tooltip-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (line-number-mode -1)
  (fset 'yes-or-no-p 'y-or-n-p)
  (delete-selection-mode t)
  (show-paren-mode 1)

  (setq fill-column 85
        initial-scratch-message ""
        show-paren-delay 0
        show-paren-style 'mixed
        visible-bell t
        browse-url-browser-function 'browse-url-chromium
        browse-url-new-window-flag  t
        browse-url-firefox-new-window-is-tab t)

  ;; Whitespaces... A colleague of mine showed me the horror of not
  ;; considering whitespaces and thus they are shown always and everywhere!
  (setq-default show-trailing-whitespace t)
#+END_SRC

#+RESULTS:
: t

A good addition is to toggle every whitespace character on demand.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (global-set-key (kbd "C-c T w") 'whitespace-mode)
  (setq whitespace-line-column nil
        whitespace-display-mappings '((space-mark 32 [183] [46])
                                      (newline-mark 10 [9166 10])
                                      (tab-mark 9 [9654 9] [92 9])))
#+END_SRC

#+RESULTS:

** Ivy

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package counsel
    :ensure t)
  (use-package ivy :ensure t
    :diminish (ivy-mode . "")
    :config
    (ivy-mode 1)
    ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
    (setq ivy-use-virtual-buffers t)
    ;; number of result lines to display
    (setq ivy-height 10)
    ;; does not count candidates
    (setq ivy-count-format "(%d/%d) ")
    ;; no regexp by default
    (setq ivy-initial-inputs-alist nil)
    ;; configure regexp engine.
    (setq ivy-re-builders-alist
          ;; allow input not in order
          '((t   . ivy--regex-ignore-order)))
    (setq swiper-stay-on-quit t)
    :bind (("C-s" . 'swiper)
           ("C-r" . 'swiper)
           ("M-x" . 'counsel-M-x)
           ("C-x C-f" . 'counsel-find-file)
           ("M-y" . 'counsel-yank-pop)
           ("C-h a" . 'counsel-apropos)
           ("C-h v" . 'counsel-describe-variable)
           ("C-h f" . 'counsel-describe-function)
           ("C-h u" . 'counsel-unicode-char)
           ("C-x b" . 'counsel-switch-buffer)
           ("C-c j" . 'counsel-git-grep)
           ("C-c L" . 'counsel-git-log)
           ))
  (use-package ivy-hydra
    :ensure t
    :after (ivy hydra))
#+END_SRC

#+RESULTS:

** Hydra

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package hydra
    :ensure ace-window
    :ensure hydra
    :init
    (defhydra hydra-zoom (global-map "<f2>")
      "zoom"
      ("g" text-scale-increase "in")
      ("l" text-scale-decrease "out"))
    (global-set-key
     (kbd "C-M-o")
     (defhydra hydra-window ()
       "window"
       ("v" (\lambda ()
             (interactive)
             (split-window-right)
             (other-window 1))
        "vert")
       ("x" (\lambda ()
             (interactive)
             (split-window-below)
             (other-window 1))
        "horz")
       ("t" transpose-frame "'")
       ("o" delete-other-windows "one" :color blue)
       ("a" ace-window "ace")
       ("s" ace-swap-window "swap")
       ("d" ace-delete-window "del")
       ("i" ace-maximize-window "ace-one" :color blue)
       ("b" switch-to-buffer "buf")
       ("m" headlong-bookmark-jump "bmk")
       ("q" nil "cancel"))))
#+END_SRC

#+RESULTS:

** Exit Confirmation

Even though unsaved buffers saved me lots of times due to prompting
for save, it happened quite often that I closed Emacs because of
mistyping. Maybe a confirmation helps and is not really annoying -
when in window system.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun martin-save-buffers-kill-emacs-with-confirm ()
    "Thanks to jsled for this method"
    (interactive)
    (if (window-system)
	(if (null current-prefix-arg)
	    (if (y-or-n-p "Are you sure you want to quit?")
		(save-buffers-kill-emacs))
	  (save-buffers-kill-emacs))
      (save-buffers-kill-terminal)))
  (global-set-key "\C-x\C-c" 'martin-save-buffers-kill-emacs-with-confirm)
#+END_SRC

#+RESULTS:
: martin-save-buffers-kill-emacs-with-confirm

** Beacon

Instead of using my own stuff, switch to beacon mode as it looks very
promising.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1))
#+end_src

#+RESULTS:
: t

