martin.org
** Snippets

From Sacha Chuas Configuration for testing

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode ;; used to remove mode line information that is not used
    :init (yas-global-mode)
    :config
    (progn
      (yas-global-mode)
      (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
      (setq yas-key-syntaxes '("w_" "w_." "^ "))
      (setq yas-snippet-dirs '("~/.emacs.d/snippets/"))
      (setq yas-expand-only-for-last-commands nil)
      (yas-global-mode 1)
      (bind-key "\t" 'hippie-expand yas-minor-mode-map)))
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (setq default-cursor-color "gray")
  (setq yasnippet-can-fire-cursor-color "purple")

  ;; It will test whether it can expand, if yes, cursor color -> green.
  (defun yasnippet-can-fire-p (&optional field)
    (interactive)
    (setq yas--condition-cache-timestamp (current-time))
    (let (templates-and-pos)
      (unless (and yas-expand-only-for-last-commands
                   (not (member last-command yas-expand-only-for-last-commands)))
	(setq templates-and-pos (if field
                                    (save-restriction
                                      (narrow-to-region (yas--field-start field)
							(yas--field-end field))
                                      (yas--templates-for-key-at-point))
                                  (yas--templates-for-key-at-point))))
      (and templates-and-pos (first templates-and-pos))))

  (defun my/change-cursor-color-when-can-expand (&optional field)
    (interactive)
    (when (eq last-command 'self-insert-command)
      (set-cursor-color (if (my/can-expand)
                            yasnippet-can-fire-cursor-color
                          default-cursor-color))))

  (defun my/can-expand ()
    "Return true if right after an expandable thing."
    (or (abbrev--before-point) (yasnippet-can-fire-p)))

  (add-hook 'post-command-hook 'my/change-cursor-color-when-can-expand)

  (defun my/insert-space-or-expand ()
    "For binding to the SPC SPC keychord."
    (interactive)
    (condition-case nil (or (my/hippie-expand-maybe nil) (insert "  "))))
#+END_SRC

#+RESULTS:
: my/insert-space-or-expand

** Dashboard

#+BEGIN_SRC emacs-lisp :tangle no
  (defun mh-dashboard-insert-inbox (list-size)
    "Add the list of LIST-SIZE items of inbox items"
    (require 'org)
    (let ((org-files (org-files-list)))
      (dashboard-insert-section "INBOX: " nil list-size "i" nil nil)))

  (defun mh-idle-switch-to-dashboard()
    (interactive)
    (switch-to-buffer "*dashboard*")
    (dashboard-refresh-buffer)
    (delete-other-windows))

  (use-package all-the-icons
    :ensure t)

  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))
          dashboard-items '((inbox . 20)
                            (agenda . 10)
                            (projects . 5)
                            (bookmarks . 5))
          dashboard-center-content t
          dashboard-set-heading-icons t
          dashboard-set-file-icons t
          dashboard-set-navigator t)

    (add-to-list 'dashboard-item-generators '(inbox . mh-dashboard-insert-inbox))

    (run-with-idle-timer 300 t 'mh-idle-switch-to-dashboard))
#+END_SRC

#+RESULTS:
: t

** Timeclock

Tracking time in a different way than before. Lets use
timeclock.el. Connecting `display-time-mode` to this functionality
might not be the best way, but for now I think that fits only here
well.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package timeclock
    :ensure t
    :init
    (display-time-mode)
    (timeclock-mode-line-display)
    :config
    (define-key ctl-x-map "ti" 'timeclock-in)
    (define-key ctl-x-map "to" 'timeclock-out)
    (define-key ctl-x-map "tc" 'timeclock-change)
    (define-key ctl-x-map "tr" 'timeclock-reread-log)
    (define-key ctl-x-map "tu" 'timeclock-update-mode-line)
    (define-key ctl-x-map "tw" 'timeclock-when-to-leave-string)
    (define-key ctl-x-map "tR" 'timeclock-generate-report)
    (add-hook 'kill-emacs-query-functions #'timeclock-query-out)
    (setq timeclock-file "~/Nextcloud/work/timelog"
          display-time-load-average nil
          timeclock-relative nil))
#+end_src

#+RESULTS:
: t

** Key Bindings
#+BEGIN_SRC emacs-lisp :tangle "init.el"
  ;; General
  (global-set-key "\C-cw" 'compare-windows)
  (global-set-key "\C-x\C-m" 'execute-extended-command)
  (global-set-key "\C-c\C-m" 'execute-extended-command)
  (global-set-key "\C-w" 'backward-kill-word)
  (global-set-key "\C-x\C-k" 'kill-region)
  (global-set-key "\C-c\C-k" 'kill-region)
  (global-set-key (kbd "C-M-r") 'isearch-backward-regexp)
  (global-set-key (kbd "C-M-s") 'isearch-forward-regexp)
  (global-unset-key (kbd "C-z")) ;; who needs that anyways?
  (global-set-key (kbd "M-o") 'other-window)
  (global-set-key (kbd "M-O") 'mh-prev-other-window)
  (global-unset-key "\C-xf")
  (global-set-key [f1] 'eshell)
  (global-set-key (kbd "C-x g") 'magit-status)
  (global-set-key (kbd "C-x b") 'magit-blame-echo)
  (global-set-key (kbd "C-x C-b") 'switch-to-buffer)
  (global-set-key (kbd "C-+") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
  (global-set-key (kbd "C-c o") 'ff-find-other-file)
  (global-set-key (kbd "C-x r l") 'counsel-bookmark)
  ;; Org-Mode
  (bind-key "C-c r" 'org-capture)
  (bind-key "C-c a" 'org-agenda)
  (bind-key "C-c l" 'org-store-link)
  (bind-key "C-c L" 'org-insert-link-global)
  (bind-key "C-c O" 'org-open-at-point-global)
  (bind-key "<f9>" 'org-agenda-list)

  (global-set-key (kbd "M-u") 'upcase-dwim)
  (global-set-key (kbd "M-l") 'downcase-dwim)
  (global-set-key (kbd "M-c") 'capitalize-dwim)
#+END_SRC

#+RESULTS:
: capitalize-dwim

#+END_SRC

#+RESULTS:
: magit-status


* Ediff

Make sure ediff does not spawn another frame.

#+begin_src emacs-lisp :tangle "init.el"
  (setq ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

#+RESULTS:
: ediff-setup-windows-plain

And ensure that the colors do not work against me when using the
gruvbox theme.

#+begin_src emacs-lisp :tangle "init.el"
  (custom-set-faces
   '(ediff-current-diff-A ((t (:foreground "Black"))))
   '(ediff-fine-diff-A ((t (:foreground "Black"))))
   '(ediff-current-diff-B ((t (:foreground "Black"))))
   '(ediff-fine-diff-B ((t (:foreground "Black"))))
   '(ediff-current-diff-C ((t (:foreground "Black"))))
   '(ediff-fine-diff-C ((t (:foreground "Black")))))
#+end_src

#+RESULTS:

* Pomodoro Timer

I am using the pomodoro technique for focus sessions and the org-mode
built-in timer gives me all the things that I need. So first we are
defining the required keybinds:

#+begin_src emacs-lisp :tangle "init.el"
  (global-set-key (kbd "C-x p i") 'mh-pomodoro-start-focus)
  (global-set-key (kbd "C-x p b") 'mh-pomodoro-start-break)
  (global-set-key (kbd "C-x p o") 'mh-pomodoro-stop)
  (global-set-key (kbd "C-x p r") 'mh-pomodoro-remaining-time)
#+end_src

Then we need the functions of course. Starting the focus period (as
well as all other functions) are based on 'org-timer-set-timer with
a predefined value for a pomodoro: 25 minutes. It should also notify
me additionally about the timer being started, similarly as it
notifies me about the finished timer:

#+begin_src emacs-lisp :tangle "init.el"
  (require 'notifications)
  (defun mh-pomodoro-start-focus()
    """ Starts a focus period """
    (interactive)
    (let ((focus-period 25))
      (notifications-notify
       :title "Focus period started"
       :on-action 'mh-pomodoro-start-focus
       :timeout 1500
       )

      (org-timer-set-timer focus-period)))
#+end_src

A break is basically the same with only 5 minutes to go.

#+begin_src emacs-lisp :tangle "init.el"
  (defun mh-pomodoro-start-break()
    """ Starts a break period """
    (interactive)
    (let ((break-period 5))
      (notifications-notify
       :title "Break period started"
       :on-action 'mh-pomodoro-start-focus
       :timeout 1500
       )
      (org-timer-set-timer break-period)))
#+end_src

And finally to stop the timer, we use the appropriate function

#+begin_src emacs-lisp :tangle "init.el"
  (defun mh-pomodoro-stop()
    """ Stops the pomodoro timer """
    (interactive)
    (notifications-notify
     :title "Pomodoro Timer stopped"
     :on-action 'mh-pomodoro-start-focus
     :timeout 1500
     )
    (org-timer-stop))
#+end_src

As having timer is nice and all, a little bit more feedback is
required. I simply use some downloaded bell sound for that, which is
stored in the nextcloud thus available on all machines.

#+begin_src emacs-lisp :tangle "init.el"
  (setq org-clock-sound "~/Nextcloud/Martin/bell.wav")
#+end_src

In between sessions it is also helpful to be able to obtain the
current remaining time. This should be retrievable and also notified
to the system.

#+begin_src emacs-lisp :tangle "init.el"
  (defun mh-pomodoro-remaining-time()
    """ Reports the remaining time """
    (interactive)
    (let ((remaining-time (org-timer-show-remaining-time)))
      (notifications-notify
       :title "Remaining time"
       :body remaining-time
       :timeout 1500
       )))
#+end_src

* Blog

** org-publish

Thanks to [[https://diego.codes/post/blogging-with-org/][Diego Vicente]] for his post on blogging with emacs as a
starting point. For the time being I'm going to go with his
configuration until the blog is somewhat running.

#+BEGIN_SRC emacs-lisp
  (use-package ox-publish
    :init

    (setq my-blog-header-file "~/blogtest/org/partials/header.html"
          my-blog-footer-file "~/blogtest/org/partials/footer.html"
          org-html-validation-link nil)

    ;; Load partials on memory
    (defun my-blog-header (arg)
      (with-temp-buffer
        (insert-file-contents my-blog-header-file)
        (buffer-string)))

    (defun my-blog-footer (arg)
      (with-temp-buffer
        (insert-file-contents my-blog-footer-file)
        (buffer-string)))

    (defun filter-local-links (link backend info)
      "Filter that converts all the /index.html links to /"
      (if (org-export-derived-backend-p backend 'html)
          (replace-regexp-in-string "/index.html" "/" link)))

    (setq org-publish-project-alist
          '(("blog-notes"
             :base-directory "~/blogtest/org"
             :base-extension "org"
             :publishing-directory "~/blogtest/public"
             :recursive t
             :publishing-function org-html-publish-to-html
             :headline-levels 4
             :section-numbers nil
             :html-head nil
             :html-head-include-default-style nil
             :html-head-include-scripts nil
             :html-preamble my-blog-header
             :html-postamble my-blog-footer)

            ("blog-static"
             :base-directory "~/blogtest/org/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|eot\\|svg\\|woff\\|woff2\\|ttf"
             :publishing-directory "~/blogtest/public"
             :recursive t
             :publishing-function org-publish-attachment
             )

            ("blog" :components ("blog-notes" "blog-static")))))

    (add-to-list 'org-export-filter-link-functions 'filter-local-links)
#+END_SRC

#+RESULTS:
| filter-local-links |

* Navigation
** Better Beginning Of The Line

Thanks to Howard Abrams for this neat function!

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  ;; remap C-a to `smarter-move-beginning-of-line'
  (global-set-key [remap move-beginning-of-line] 'smarter-move-beginning-of-line)
  (global-set-key [remap org-beginning-of-line]  'smarter-move-beginning-of-line)

#+END_SRC

#+RESULTS:
: smarter-move-beginning-of-line
** Previous other window

As there appears not to be any simple function to return to the
previous window instead of directly passing a negative argument to

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun mh-prev-other-window()
    "Simple function wrapper to `other-window' with a negative argument"
    (interactive)
     (other-window -1))
#+END_SRC

** Moving Files

Moving files using /rename-file/ or /dired-do-rename/ does not modify the
buffer of that file, which is not what I usually want. Taken from [[http://zck.me/emacs-move-file][here]]
is a method to not just rename the file but also the buffer associated
with the file.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun move-file (new-location)
    "Write this file to NEW-LOCATION, and delete the old one."
    (interactive (list (if buffer-file-name
			   (read-file-name "Move file to: ")
			 (read-file-name "Move file to: "
					 default-directory
					 (expand-file-name (file-name-nondirectory (buffer-name))
							   default-directory)))))
    (when (file-exists-p new-location)
      (delete-file new-location))
    (let ((old-location (buffer-file-name)))
      (write-file new-location t)
      (when (and old-location
		 (file-exists-p new-location)
		 (not (string-equal old-location new-location)))
	(delete-file old-location))))

  (bind-key "C-x C-m" 'move-file)
#+END_SRC

** Dired

Handling dired buffers is kind of cumbersome for me, especially
because opening a folder means more buffers for every folder I
enter. This is not bad per se, but not really what I would
like. Following the great emacs news by Sacha Chua, I found [[http://xenodium.com/#drill-down-emacs-dired-with-dired-subtree][this]] on
reddit:

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package dired-subtree
    :ensure t
    :after dired
    :config
    (setq dired-subtree-use-backgrounds nil)
    (bind-key "<tab>" #'dired-subtree-toggle dired-mode-map)
    (bind-key "<backtab>" #'dired-subtree-cycle dired-mode-map))
#+END_SRC

#+RESULTS:
: t

* Editing
** yaml-mode

#+begin_src emacs-lisp :tangle "init.el"
  (use-package yaml-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.yml\\'" .  yaml-mode))
    (add-hook 'yaml-mode-hook
              '(lambda ()
                 (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
    )
#+end_src

#+RESULTS:
: t

** Expand Region

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package expand-region
    :ensure t
    :commands ( er/expand-region er/contract-region )
    :bind ("M-r" . er/expand-region)
    :bind ("M-q" . er/contract-region)
    )
#+END_SRC

#+RESULTS:
: er/contract-region

