martin.org
*** ERC

Typical settings for work stuff.

#+begin_src emacs-lisp
    (use-package erc
      :init
      (setq erc-server-alist
       '(("Emlix GmbH IRC Server" emlix "irc.emlix.com" 6667)
       ))
      (setq erc-autojoin-timing 'ident)
      (setq erc-nick "martin_daheeme")
      (setq erc-user-full-name "Martin H")
      (setq erc-track-shorten-start 8)
      (setq erc-autojoin-channels-alist
       '(("irc.emlix.com" "#emlix")
         ))
      (setq erc-kill-buffer-on-part t)
      (setq erc-auto-query 'bury)
      :config
      (add-hook 'erc-mode-hook
                (lambda ()
                  (setq show-trailing-whitespace nil)))
      (add-hook 'erc-list-mode-hook
                (lambda ()
                  (setq show-trailing-whitespace nil)))
      (add-to-list 'erc-modules 'notifications)
      (add-to-list 'erc-modules 'spelling)
      (add-to-list 'erc-modules 'log)
      (erc-services-mode 1)
      (erc-update-modules))
#+end_src

#+RESULTS:
: t

Message display optimizations. Align the column 20 characters to the
right such that all texts are not left aligned and start wherever the
name ends.

#+begin_src emacs-lisp
  (setq erc-fill-column 120
        erc-fill-function 'erc-fill-static
        erc-fill-static-center 20)
#+end_src

Change the prompt as having timestamps to the right is rather
annoying.

#+begin_src emacs-lisp
  (setq erc-prompt (lambda () (concat "to " (buffer-name) " >")))
  (setq erc-fill-prefix "       | ")
  (setq erc-timestamp-format "[%H:%M] | ")
#+end_src

I miss the colors in IRC so lets use a package for that.

#+begin_src emacs-lisp
  (use-package erc-hl-nicks
    :ensure t
    :after erc)
#+end_src

#+RESULTS:

Showing images appears to be nice as well

#+begin_src emacs-lisp
  (use-package erc-image
    :ensure t
    :after erc)
#+end_src

After the notifications work fine, I'd like to get notifications for
specific channels, in this case especially for all channels related to
my work IRC. [[https://jcubic.wordpress.com/2012/07/24/erc-notifications-on-channels-where-there-was-activity-after-some-inactivity/][Jakub Jankiewicz]] has a nice solution that I borrowed.

#+begin_src emacs-lisp
  (setq inactivity-buffer-alist '(("#emlix" (inactivity . 900))
                                  ("#mhtest" (inactivity . 3))))
  
  (defun async-exec-command (command &rest success)
    (interactive)
    (let* ((buffer-name (generate-new-buffer-name "**shell**"))
           (buffer (get-buffer-create buffer-name))
           (process (apply #'start-process
                           (append (list buffer-name buffer)
                                   (split-string command " ")))))
      (lexical-let ((buffer buffer) (success (car success)) (command command))
        (set-process-sentinel process
                              (if success (lambda (process str)
                                            (if (string= str "finished\n")
                                                (save-excursion
                                                  (set-buffer buffer)
                                                  (let ((content (buffer-string)))
                                                    (kill-buffer buffer)
                                                    (funcall success content)))))
                                (lambda (proces str)
                                  (kill-buffer buffer)))))
      (concat "execute: " command)))
  
  (defun channel-activity (string &rest ignore)
    "Notification when there is activity on a erc channel after inactivity"
    (let* ((buffer (buffer-name))
           (buffer-alist-pair (assoc buffer inactivity-buffer-alist))
           (buffer-alist (cdr buffer-alist-pair))
           (current-time (current-time)))
      (if (not (null buffer-alist))
          (let ((last-time-pair (assoc 'last-time buffer-alist))
                (inactivity (cdr (assoc 'inactivity buffer-alist))))
            (if (not (and (string-match "^\\*\\*\\*" string)
                          (string-match "[freenode-info]" string)))
                (progn
                  (if (or (null last-time-pair)
                          (> (float-time (time-subtract current-time
                                                        (cdr last-time-pair)))
                             inactivity))
                      (async-exec-command "mpg123 -q /home/martin/sounds/beep.mp3"))
                  (if (null last-time-pair)
                      (setf (cdr buffer-alist-pair)
                            (append buffer-alist
                                    (list (cons 'last-time current-time))))
                    (setf (cdr last-time-pair) current-time))))))))

  (add-hook 'erc-insert-pre-hook 'channel-activity)
#+end_src

#+RESULTS:
| channel-activity |

** Mail

At work I am using mutt for handling my emails, mostly because the
accessibility to all the other buffers I have opened and in part also
because I am using a en_US keyboard layout which can be kind of
problematic in official german emails. I used mutt for quite some time
now and I just found out, that I don't use the appropriate mode for my
emails. Let's fix that.

[[https://www.emacswiki.org/emacs/MuttInEmacs][Emacs Wiki]]

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-to-list 'auto-mode-alist '(".*mutt.*" . message-mode))
  (setq mail-header-separator "")
  (add-hook 'message-mode-hook
	    'turn-on-auto-fill
	    (function
	     (lambda ()
	       (progn
		 (local-unset-key "\C-c\C-c")
		 (define-key message-mode-map "\C-c\C-c" '(lambda ()
							    "save and exit quickly"
							    (interactive)
							    (save-buffer)))))))
#+END_SRC

#+RESULTS:
| turn-on-auto-fill |

Aaaand, it would be gread to use org tables in mails as well.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-hook 'message-mode-hook 'turn-on-orgtbl)
#+END_SRC

*** notmuch and such

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (when (executable-find "notmuch")
    (define-key global-map "\C-cm" 'notmuch)
    (setq sendmail-program "/usr/bin/msmtp"
          notmuch-search-oldest-first nil
          mail-specify-envelope-from t
          message-sendmail-envelope-from 'header
          mail-specify-envelope-from 'header
          notmuch-show-all-multipart/alternative-parts nil
          notmuch-fcc-dirs "emlix/Sent +sent -unread"
          ))
#+END_SRC

#+RESULTS:
: emlix/Sent +sent -new

Initial cursor position in hello window

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-hook 'notmuch-hello-refresh-hook
		(lambda ()
                  (if (and (eq (point) (point-min))
                           (search-forward "Saved searches:" nil t))
                      (progn
			(forward-line)
			(widget-forward 1))
                    (if (eq (widget-type (widget-at)) 'editable-field)
			(beginning-of-line)))))

   (setq notmuch-crypto-process-mime t)
#+END_SRC

Faces

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (setq notmuch-search-line-faces '(("unread" :weight bold)
                                    ("flagged" :foreground "red")))
#+END_SRC

Modeline

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (setq martin/notmuch-activity-string "")
  (add-to-list 'global-mode-string '((:eval martin/notmuch-activity-string)) t)
  (defun martin/get-notmuch-incoming-count ()
    (string-trim
     (shell-command-to-string
      "notmuch count tag:inbox AND tag:unread AND '\(folder:INBOX or folder:INBOX.Eyeo\)'")))
  (defun martin/format-notmuch-mode-string (count)
    (concat " mails[" (if (string= count "0") "" count) "]"))
  (defun martin/update-notmuch-activity-string (&rest args)
    (setq martin/notmuch-activity-string
          (martin/format-notmuch-mode-string (martin/get-notmuch-incoming-count)))
    (force-mode-line-update))
  (add-hook 'notmuch-after-tag-hook 'martin/update-notmuch-activity-string)
  (defcustom notmuch-presync-hook nil
    "Hook run before notmuch is synchronised"
    :type 'hook)
  (defcustom notmuch-postsync-hook '(martin/update-notmuch-activity-string)
    "Hook run after notmuch has been synchronised"
    :type 'hook)

#+END_SRC

#+RESULTS:
: martin/update-notmuch-activity-string

* Learning


* Startup

Testing some scripts for startup

#+BEGIN_SRC sh
  #!/bin/bash

  #set -x

  CG=$HOME/git/CG_bitbucket
  GH=$HOME/github

  err () {
      notify-send "$1"
      exit 1
  }

  REPOSITORIES="\
                   $CG/eudyptula \
                   $CG/org \
                   $CG/misc \
                   $CG/opencv-testbed \
                   $GH/emacs-org \
                   $GH/algorithms \
                   $GH/psp \
                   $GH/psp4android \
                   $GH/thelinuxprogramminginterface \
  "

  for repo in $REPOSITORIES; do
      if [ ! -d $repo ]; then
	  err "repo $(basename $repo) is not available"
      fi

      # execute everything in a subshell, may be useful later on
      (
	  cd $repo

	  status=$(git status -s)
	  if [ "y$status" != "y" ]; then
	      # can be unstaged or untracked
	      if [ $(expr match "$status" '^??.*') -eq 0 ]; then  # if unstaged
		  err "$(basename $repo) has unstaged changes"
	      fi
	  fi

	  git status | grep -e behind >/dev/null
	  ret=$?
	  if [ $ret -eq 0 ]; then
	      echo "Pulling changeds from $repo"
	      {
		  git pull
	      } &>/dev/null
	      if [ $? -eq 1 ]; then
		  err "unable to pull repo $repo"
	      fi
	  fi

	  git status | grep -e ahead >/dev/null
	  ret=$?
	  if [ $ret -eq 0 ]; then
	      echo "Pushing changes to $repo"
	      {
		  git push
	      } &>/dev/null
	      if [ $? -eq 1 ]; then
		  err "unable to push repo $repo"
	      fi
	  fi
      )
  done
#+END_SRC

#+RESULTS:

* Ledger

I use ledger to collect any accounting data.

#+BEGIN_SRC emacs-lisp
  (use-package ledger-mode
    :ensure t)

  (setenv "PATH" (concat (concat "/home/" user-login-name "/bin:")
			 (getenv "PATH")))
  (push (concat "/home/" user-login-name "/bin") exec-path)
#+END_SRC

(getenv "PATH")
#+RESULTS:

* Org

** Org-Mode
*** General

As the most awesome people do, I too use org-mode! :)

Thanks to Isa Mert Gurbuz (https://isamert.net/)

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (use-package org
    :ensure t
    :init
    (setq org-log-done 'time)
    (setq org-clock-report-include-clocking-task t)
    :config
    (add-hook 'org-clock-in-hook 'martin/org-clock-in-set-state-to-started)
    (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
    (setq org-hide-emphasis-markers t
          org-src-window-setup 'current-window
          org-support-shift-select t
          org-use-speed-commands t)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((shell . t)
       (shell . t)
       (js . t)
       (python . t)
       (C . t)
       (css . t)
       (dot . t)
       (plantuml . t)
       (emacs-lisp . t)))
    )

  (bind-key "C-c v" 'org-show-todo-tree org-mode-map)
  (bind-key "C-c C-r" 'org-refile org-mode-map)
  (bind-key "C-c R" 'org-reveal org-mode-map)

  (use-package org-bullets
    :ensure t
    :hook (org-mode . org-bullets-mode)
    :config
    (setq org-ellipsis "➔"))

  (use-package org-fancy-priorities
    :diminish
    :ensure t
    :hook (org-mode . org-fancy-priorities-mode)
    :config (setq org-fancy-priorities-list '("🅰" "🅱" "🅲" "🅳" "🅴")))

  ;; Also here is `isamert/prettify-mode' macro.
  ;; You don't need this but it's a bit more convinient if you make use of
  ;; prettify-symbols minor mode a lot
  (defmacro isamert/prettify-mode (mode pairs)
    "Prettify given PAIRS in given MODE. Just a simple wrapper around `prettify-symbols-mode`"
    `(add-hook ,mode (lambda ()
                       (mapc (lambda (pair)
                               (push pair prettify-symbols-alist))
                             ,pairs)
                       (prettify-symbols-mode))))

  (isamert/prettify-mode 'org-mode-hook
                         '(("[ ]" . "☐")
                           ("[X]" . "☑" )
                           ("[-]" . "❍" )))
  #+END_SRC

#+RESULTS:
: t

Using actual circular bullets for bullet lists

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (font-lock-add-keywords 'org-mode
                          '(("^ +\\([-*]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
#+END_SRC

#+RESULTS:

*** Taking Notes

Setting the directories for the notes to be placed in - this will be
synced soonish.

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-directory (expand-file-name "~/git/org-files"))
  (setq org-default-notes-file (expand-file-name "~/git/org-files/personal.org"))
#+END_SRC

#+RESULTS:
: ~/git/org/personal.org

**** Templates

Let's use =org-capture= to quickly add the things that come to mind all the time :)

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (defvar martin/org-project-template "* %^{Project Description} %^g
  :PROPERTIES:
  :Effort: %^{effort|1:00|0:05|0:10|0:15|0:30|0:45|2:00|4:00|8:00}
  :END:
  SCHEDULED: %^t
  - Why?
    %?
  - What?
  - Who?
  - Where?
  - How?
  - Outcome?
  ,** Brainstorming
    Collect 10 Ideas
  " "Full Project Description")
  (defvar martin/org-basic-task-template "* TODO %^{Task}
  SCHEDULED: %^t
  :PROPERTIES:
  :Effort: %^{effort|1:00|0:05|0:10|0:15|0:30|0:45|2:00|4:00}
  :END:
  %?
  " "Basic task data")
  (defvar martin/org-programming-workout-template "* %^{Workout Description}
  :PROPERTIES:
  :Effort: %^{effort|0:05|0:10|0:15|0:20|0:25}
  :END:
  %^g%?
  " "Programming Workout Template")
  (defvar martin/org-journal-template
    "**** %^{Description} %^g
       %?"
    "Journal Template")
  (defvar martin/org-work-journal-template
    "**** %^{Description} %^g
       %T
       %?"
    "Work Journal Template")
  (setq org-capture-templates
        `(("t" "Tasks" entry
           (file+headline "~/git/org-files/personal.org" "INBOX")
           ,martin/org-basic-task-template)
          ("T" "Quick Task" entry
           (file+headline "~/git/org-files/personal.org" "INBOX")
           "* TODO %^{Task}"
           :immediate-finish t)
          ("j" "Journal entry" plain
           (file+olp+datetree "~/git/org-files/journal.org")
           ,martin/org-journal-template)
          ("a" "Appointments" entry
           (file+headline "~/git/org-files/organizer.org" "Appointments")
           "* %?\n%i")
          ("d" "Decisions" entry
           (file+headline "~/git/org-files/personal.org" "Decisions")
           "* %?\n%i")
          ("d" "Decisions" entry
           (file+headline "~/git/org-files/personal.org" "Decisions")
           "* %?\n%i")
          ("e" "Emlix journal entry" plain
           (file+olp+datetree "~/git/org-files/emlix-journal.org")
           ,martin/org-work-journal-template)
          ("p" "Project" entry
           (file+headline "~/git/org-files/personal.org" "Projects")
           ,martin/org-project-template)
          ("w" "Work journal entry" plain
           (file+olp+datetree "~/git/org-files/work-journal.org")
           ,martin/org-work-journal-template)
          ("W" "Workout" entry
           (file+headline "~/git/org-files/personal.org" "Primary Skills")
           ,martin/org-programming-workout-template)))
  (bind-key "C-M-r" 'org-capture)
#+END_SRC

#+RESULTS:
: org-capture

**** Refiling

=org-refile= lets you organize notes by typing in the headline to file
them under.

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-reverse-note-order t)
  (setq org-refile-use-outline-path nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-refile-use-cache nil)
  (setq org-refile-targets '((org-agenda-files . (:maxlevel . 6))))
  (setq org-blank-before-entry nil)
#+END_SRC

#+RESULTS:


*** Managing Tasks

