martin.org
**** Track TODO state

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"   ; next action
           "TOBLOG(b)"  ; next action
           "REVIEW(r)"  ; next action
           "STARTED(s)"
           "WAITING(w@/!)"
           "SOMEDAY(.)" "|" "DONE(x!)" "CANCELLED(c@)")
          (sequence "TODELEGATE(-)" "DELEGATED(d)" "|" "COMPLETE(x)")))

  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "green" :weight bold))
          ("DONE" . (:foreground "cyan" :weight bold))
          ("REVIEW" . (:foreground "blue" :weight bold))
          ("WAITING" . (:foreground "red" :weight bold))
          ("SOMEDAY" . (:foregound "gray" :weight bold))))
#+END_SRC

#+RESULTS:
| TODO    | :foreground | green | :weight | bold |
| DONE    | :foreground | cyan  | :weight | bold |
| REVIEW  | :foreground | blue  | :weight | bold |
| WAITING | :foreground | red   | :weight | bold |
| SOMEDAY | :foregound  | gray  | :weight | bold |

**** Tag Tasks with GTD-ish contexts

This defines the key commands for those, too.

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-tag-alist '(("call" . ?c)
                        ("@computer" . ?l)
                        ("@home" . ?h)
                        ("errand" . ?e)
                        ("@office" . ?o)
                        ("@anywhere" . ?a)
                        ("meetings" . ?m)
                        ("readreview" . ?r)
                        ("writing" . ?w)
                        ("programming" . ?p)
                        ("short" . ?s)
                        ("quantified" . ?q)
                        ("highenergy" . ?1)
                        ("lowenergy" . ?0)
                        ("business" . ?B)))
#+END_SRC

#+RESULTS:

*** Org Agenda

**** Basic Configuration

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq my-org-agenda-files-list (append
                                  (file-expand-wildcards "~/git/org-files/*.org"))
        org-agenda-files
        (delq nil
              (mapcar (lambda (x) (and (file-exists-p x) x))
                      my-org-agenda-files-list)))
#+END_SRC

This is some configuration of Sacha's
#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-agenda-span 'week)
  (setq org-agenda-sticky nil)
  (setq org-agenda-show-log t)
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
  (setq org-columns-default-format "%50ITEM %12SCHEDULED %TODO %3PRIORITY %Effort{:} %TAGS")
#+END_SRC

#+RESULTS:
: %50ITEM %12SCHEDULED %TODO %3PRIORITY %Effort{:} %TAGS

*** Literate Programming

For syntax highlighting of org src blocks and disabling the
confirmation of executing those blocks the following variables are set

#+BEGIN_SRC emacs-lisp :tangle "mh-modules/mh-org.el"
  (setq org-confirm-babel-evaluate nil
        org-src-fontify-natively t
        org-src-tab-acts-natively t)
#+END_SRC

#+RESULTS:
: t

** Org-GTD

#+begin_src emacs-lisp :tangle "mh-modules/mh-org.el"
  (use-package org-gtd
    :after org
    :ensure t
    :init
    (setq org-edna-use-inheritance t
          org-gtd-directory (file-truename "~/Nextcloud/private/org/gtd")
          org-gtd-clarify-show-horizons 'right
          org-gtd-areas-of-focus '("Home" "Health" "Family" "Career" "Beer")
          )
    (org-edna-mode 1)
    :bind (("C-c d c" . org-gtd-capture)
           ("C-c d e" . org-gtd-engage)
           ("C-c d f" . org-gtd-area-of-focus-set-on-item-at-point)
           ("C-c d l" . org-gtd-clarify-item)
           :map org-gtd-clarify-map
           ("C-c c" . org-gtd-organize)
           ("C-c f" . org-gtd-area-of-focus-set-on-item-at-point)
           ("C-c t" . org-gtd-clarify-toggle-horizons-window))
  )
#+end_src

#+RESULTS:
: org-gtd-clarify-toggle-horizons-window

** Org-Roam

#+begin_src emacs-lisp :tangle "mh-modules/mh-org.el"
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Nextcloud/Martin/RoamNotes")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert))
    :config
    (org-roam-setup))
#+end_src

#+RESULTS:

** Provide =mh-org.el= module

#+begin_src emacs-lisp :tangle "mh-modules/mh-org.el"
  (provide 'mh-org)
#+end_src

* Programming
** General

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package auto-complete
    :ensure t
    :config
    (ac-config-default)
    (global-auto-complete-mode t))
#+END_SRC

#+RESULTS:
: t

** Language Server

To enable language server support, apparently lsp-mode is the new
standard for emacs integration. As I am mostly developing C/C++ stuff
for now, I use ccls as the language server of choice.

Find the ccls executable first
#+NAME: find-ccls
#+begin_src sh :results output :tangle no
  command -v ccls
#+end_src

#+RESULTS: find-ccls
: /usr/bin/ccls

#+RESULTS:

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (setq lsp-use-plists t)
  (use-package ccls
    :ensure t
    :init
    (setq lsp-lens-enable nil)
    :config
    (setq ccls-executable "/usr/bin/ccls"
          gc-cons-threshold (* 1024 1024 100)
          read-process-output-max (* 1024 1024) ;; 1mb
          lsp-enable-on-type-formatting nil)
    :hook ((c-mode c++-mode) .
           (lambda () (require 'ccls) (lsp)))
    )
  (use-package lsp-mode
    :ensure t
    :commands lsp
    )
  (use-package lsp-ui
    :ensure t
    :commands lsp-ui-mode
    )
#+END_SRC

#+RESULTS:

** C

Linux kernel coding style adjustments

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun c-lineup-arglist-tabs-only ()
    "Line up argument lists by tabs, not spaces"
    (let* ((anchor (c-langelem-pos c-syntactic-element))
           (column (c-langelem-2nd-pos c-syntactic-element))
           (offset (- (1+ column) anchor))
           (steps (floor offset c-basic-offset)))
      (* (max steps 1)
         c-basic-offset)))

  (defun my/general-c-mode-configuration ()
    (setq indent-tabs-mode t)
    (setq c-basic-offset 8
          cdefault-style "linux"
          tab-width 8
          indent-tabs-mode nil
          c-set-style "linux-tabs-only")
    (define-key c-mode-base-map (kbd "RET") 'newline-and-indent))
  (defun my/add-semantic-to-autocomplete ()
    (add-to-list 'ac-sources 'ac-source-semantic))

  (defun my/general-c++-mode-configuration ()
    (setq c-basic-offset 4
          tab-width 4
          indent-tabs-mode nil)
    (define-key c-mode-base-map (kbd "RET") 'newline-and-indent))

  (add-hook 'c-mode-common-hook 'my/add-semantic-to-autocomplete)
  (add-hook 'c-mode-common-hook 'my/general-c-mode-configuration)
  (add-hook 'c++-mode-hook 'my/general-c++-mode-configuration)
  (add-hook 'c-mode-common-hook
            (lambda ()
              ;; Add kernel style
              (c-add-style
               "linux-tabs-only"
               '("linux" (c-offsets-alist
                          (arglist-cont-nonempty
                           c-lineup-gcc-asm-reg
                           c-lineup-arglist-tabs-only))))))
#+END_SRC

Define a function that intializes auto-complete-c-headers and gets
called for c/c++ hooks

#+BEGIN_SRC emacs-lisp :tangle "init.el"
    (use-package auto-complete-c-headers
      :ensure t
      :config
      (add-to-list 'ac-sources 'ac-source-c-headers))

    (defun my/init-ac-c-headers ()
      (add-to-list 'achead:include-directories '"/usr/src/linux/include/"))

    (add-hook 'c++-mode-hook 'my/init-ac-c-headers)
    (add-hook 'c-mode-hook 'my/init-ac-c-headers)
#+END_SRC

Use flycheck for syntax checking

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package flycheck
    :ensure flycheck-cstyle
    :config
    (eval-after-load 'flycheck
      '(progn
         (flycheck-cstyle-setup)
         (flycheck-add-next-checker 'c/c++-cppcheck '(warning . cstyle))))
    (global-flycheck-mode)
    (add-hook 'c-mode-hook
              (lambda () (setq flycheck-gcc-include-path
                               (list "/usr/src/linux/include" ))))
    (add-hook 'c-mode-hook
              (lambda () (setq flycheck-gcc-language-standard "c11")))
    (add-hook 'cc-mode-hook
              (lambda () (setq flycheck-gcc-language-standard "c++17")))
    (add-hook 'sh-mode-hook 'flycheck-mode)
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
#+END_SRC

#+RESULTS:
: t

Highlight TODO/FIXME/etc

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun my-highlight-keywords-warning()
    ""
    (font-lock-add-keywords nil
			    '(("\\<\\(FIXME\\|TODO\\|XXX+\\|BUG\\|TBD\\):"
			       1 font-lock-warning-face prepend))))
  (defun my-highlight-keywords-info()
    ""
    (font-lock-add-keywords nil
			    '(("\\<\\(NOTE\\|INFO\\):"
			       1 font-lock-comment-face prepend))))

  (add-hook 'c-mode-hook 'my-highlight-keywords-warning)
  (add-hook 'c-mode-hook 'my-highlight-keywords-info)
  (add-hook 'c++-mode-hook 'my-highlight-keywords-warning)
  (add-hook 'c++-mode-hook 'my-highlight-keywords-info)
#+END_SRC

#+RESULTS:
| my-highlight-keywords-info | my-highlight-keywords-warning | fix-enum-class | my-highlight-keywords | my/init-ac-c-headers |

Add compile keybinding and adjust initial command

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-hook 'c-mode-common-hook
            (lambda () (define-key c-mode-base-map (kbd "C-c C-l") 'compile)))



#+END_SRC

** Shell

Finally fixing the indentation of my shell mode.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun martin-setup-sh-mode()
    "sh-mode customizations."
    (interactive)
    (setq sh-basic-offset 8
          sh-indentation 8))

  (add-hook 'sh-mode-hook 'martin-setup-sh-mode)
#+END_SRC

Use shellcheck

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-hook 'sh-mode-hook 'flycheck-mode)
#+END_SRC

** C++

*** Indentation enum class

This indentation is not working in the original c++-mode, thus a fix is needed:

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (defun inside-class-enum-p (pos)
    "Checks if POS is within the braces of a C++ \"enum class\"."
    (ignore-errors
      (save-excursion
	(goto-char pos)
	(up-list -1)
	(backward-sexp 1)
	(looking-back "enum[ \t]+class[ \t]+[^}]+"))))

  (defun align-enum-class (langelem)
    (if (inside-class-enum-p (c-langelem-pos langelem))
	(c-lineup-topmost-intro-cont langelem)))

  (defun align-enum-class-closing-brace (langelem)
    (if (inside-class-enum-p (c-langelem-pos langelem))
	'-
      '+))

  (defun fix-enum-class ()
    "Setup `c++-mode' to better handle \"class enum\"."
    (add-to-list 'c-offsets-alist '(topmost-intro-cont . align-enum-class))
    (add-to-list 'c-offsets-alist
		 '(statement-cont . align-enum-class-closing-brace)))

  (add-hook 'c++-mode-hook 'fix-enum-class)
#+END_SRC

#+RESULTS:
| fix-enum-class | my/init-ac-c-headers |

** Linux
*** dts mode

After some time digging through device tree files it is time to use an
appropriate mode..

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package dts-mode
    :ensure t)
#+END_SRC

#+RESULTS:


** WebDev

For work I need some php/javascript combination support. Web-mode
gives me what I need so far.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package web-mode
    :ensure t
    :config
    (defun my-setup-php ()
      ;; enable web mode
      (web-mode)

      ;; make these variables local
      (make-local-variable 'web-mode-code-indent-offset)
      (make-local-variable 'web-mode-markup-indent-offset)
      (make-local-variable 'web-mode-css-indent-offset)

      ;; set indentation, can set different indentation level for different code type
      (setq web-mode-code-indent-offset 4)
      (setq web-mode-css-indent-offset 2)
      (setq web-mode-markup-indent-offset 2))
    (add-to-list 'auto-mode-alist '("\\.php$" . my-setup-php))
    )
#+END_SRC

#+RESULTS:
: t

I started coding Javascript lately and thus an appropriate mode is
needed. [[http://truongtx.me][Truong TX]] gave a nice example.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (add-to-list 'auto-mode-alist '("\\.json$" . js-mode))

  (use-package js2-mode
    :ensure t
    :init
    (add-hook 'js-mode-hook 'js2-minor-mode)
    (setq js2-highlight-level 3))

  (use-package ac-js2
    :ensure t
    :init
    (add-hook 'js2-mode-hook 'ac-js2-mode))


  (use-package flymake-jslint
    :ensure t
    :config
    (add-to-list 'load-path (file-truename "~/git/lintnode"))
    (setq lintnode-location (file-truename "~/git/lintnode"))
    (setq lintnode-jslint-excludes (list 'nomen 'undef 'plusplus 'onevar 'white))
    ;;; TODO: does not work currently, investigate
                                          ; (add-hook 'js-mode-hook
                                          ;	    (lambda()
                                          ; (lintnode-hook))))
)
#+END_SRC

#+RESULTS:
: t

** Common Lisp

I learned to love slime really quickly.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
  (use-package slime
    :ensure t)

  (setq inferior-lisp-program "/usr/bin/clisp")
#+END_SRC

* Org Settings
#+STARTUP: indent content hidestars
